#Найдите сумму цифр трехзначного числа.
a = (input())

a1 =int(a[0])
a2 = int(a[1])
a3 = int(a[-1])
print(a1+a2+a3)